//Overall SOC Score

SecurityIncident
| where TimeGenerated >= (90d)
| extend email_ = tostring(Owner.email)
| summarize Info_Value=count(Severity == "Informational" and Status != "Closed") * 2, Low_Value=count(Severity == "Low" and Status != "Closed") * 3, Medium_Value=count(Severity == "Medium" and Status != "Closed") * 4, High_Value=count(Severity == "High" and Status != "Closed") * 5, New_Count=count(TimeGenerated >= ago(24h) and Status == "New"), Open_Count=count(TimeGenerated >= ago(90d) and Status != "Closed"), Closed_Count=count(TimeGenerated >= ago(90d) and Status == "Closed"), Unassigned_Count=count(TimeGenerated >= ago(24h) and Status == "New" or Status == "Active" and isempty(email_))
| project New_Count + Open_Count + Closed_Count + Unassigned_Count + Info_Value + Low_Value + Medium_Value + High_Value
